In [64]:
import pandas as pd
import numpy as np
import random
import string
np.random.seed(56)

In [128]:
pd.DataFrame({"A":[1,2], "B":[3,4]},index=[1,2])

   A  B
1  1  3
2  2  4

In [9]:
pd.DataFrame({"A":[1,2],"B":[3,4],"C":[5,6]},index=[1,2])

   A  B  C
1  1  3  5
2  2  4  6

In [10]:
pd.DataFrame([[1,2,3],[4,5,6]],index=[1,2], columns=["A","B","C"])

   A  B  C
1  1  4  7
2  2  5  8
3  3  6  9

In [11]:
pd.DataFrame(np.random.randint(0, 100, size=(2, 3)))

    가   나   다   라
a  10  30  50  70
b  20  40  60  80

In [12]:
pd.Series({"한국":"서울","일본":"도쿄","중국":"베이징",})

   A  B  C
1  1  2  3
2  4  5  6

In [67]:
def id():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))

In [98]:
[id() for i in range(1,11)]

['RqehB',
 'nYUdV',
 'YlVmI',
 'WZMzP',
 'aDgxB',
 'hLYLT',
 'HvTCk',
 'YdOaS',
 'rOXUS',
 'YFHDs']

In [69]:
def score():
    return np.random.randint(0,100)

In [105]:
[score() for i in range(1,5)],[score() for i in range(1,5)]

([17, 75, 49, 93], [44, 14, 94, 25])

In [119]:
pd.DataFrame([[score() for i in range(1,5)]], index=[id() for i in range(1, 11)], columns=['국어','영어','수학','사회'])

       국어  영어  수학  사회
CeXWs  69  69  97  27
ApsyS  69  69  97  27
bYGxp  69  69  97  27
lkynj  69  69  97  27
GfYUW  69  69  97  27
wLkYN  69  69  97  27
mjaGc  69  69  97  27
YlzKS  69  69  97  27
lVRmG  69  69  97  27
tTesa  69  69  97  27

In [120]:
pd.DataFrame(np.random.randint(0, 100, size=(10, 4)),
             index=list((''.join(random.choice(string.ascii_letters) for i in range(5))) for i in range(10)),
             columns=['국어', '영어', '수학', '사회']
            )

       국어  영어  수학  사회
CVhMN  78  20  51  73
lUAzh  39  86  23  87
gsfkO  46  48  84  62
OjFPl  72  25  96   1
JIIZe  75  65  67  22
cMPMm  69  66  22  39
FDkhu  61  43  71  57
vzCYB  94  15   3  35
ABTwh  14  88  24  56
GSuSC  41  94  77  62